ERP.belugaerp/src/InformationRegisters/бг_СтатусыЗаписиДвиженийМарок/бг_СтатусыЗаписиДвиженийМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_СтатусыЗаписиДвиженийМарок</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыЗаписиДвиженийМарок</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновленияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СтатусыЗаписиДвиженийМарок/бг_СтатусыЗаписиДвиженийМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыЗаписиДвиженийМарок</name>
  <enumValues>
    <name>ДвиженияЗарегистрированыКЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияЗаписываются</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаЗаписиДвижений</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияУспешноЗаписаны</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/InformationRegisters/бг_СтатусыЗаписиДвиженийМарок/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Установить статус записи движений марок
//
// Параметры:
//  Документ - ДокументСсылка.ТТНВходящаяЕГАИС - Ссылка на документ, для которого нужно установить статус
//  Статус	 - ПеречислениеСсылка.бг_СтатусыЗаписиДвиженийМарок - устанавливаемый статус
//
Процедура УстановитьСтатус(Документ, Статус) Экспорт
	
	НаборЗаписей = РегистрыСведений.бг_СтатусыЗаписиДвиженийМарок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Документ = Документ;
	Запись.Статус = Статус;
	Запись.ДатаОбновленияСтатуса = ТекущаяДата();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ДвиженияЗаписываютсяВДанныйМомент(Документ) Экспорт

	Возврат ТекущийСтатус(Документ) = Перечисления.бг_СтатусыЗаписиДвиженийМарок.ДвиженияЗаписываются;
	
КонецФункции

Процедура УстановитьБлокировкуИзмененияСтатуса(Документ) Экспорт

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.бг_СтатусыЗаписиДвиженийМарок");
	ЭлементБлокировки.УстановитьЗначение("Документ", Документ);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущийСтатус(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бг_СтатусыЗаписиДвиженийМарок.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.бг_СтатусыЗаписиДвиженийМарок КАК бг_СтатусыЗаписиДвиженийМарок
		|ГДЕ
		|	бг_СтатусыЗаписиДвиженийМарок.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекущийСтатус = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ТекущийСтатус = ВыборкаДетальныеЗаписи.Статус;
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции

#КонецОбласти
